import os

# ইনপুট এবং আউটপুট ফাইলের নাম
input_file = "name.txt"
output_file = "user-name.txt"

# চেক করা হচ্ছে মূল ফাইলটি আছে কি না
if not os.path.exists(input_file):
    print(f"Error: {input_file} file not found please check again file name")
else:
    # ৫-৬টি আলাদা কম্বিনেশন প্যাটার্ন
    patterns = [
    "@1990", "@1991", "@1992", "@1993", "@1994", "@1995", "@1996", "@1997", "@1998", "@1999",
    "@2000", "@2001", "@2002", "@2003", "@2004", "@2005", " 2006", "@2007", "@2008", "@2009", "@2010", "@2011", "@2012", "@2013", "@2014", "@2015", "@2016", "@2017", "@2018", "@2019", "@2020", "@2024", "@2025", "@2026",
    "@1122", "@1212", "@1234", "@2233", "@4455", "@5566", "@7788", "@8899", "@0000", "@9999",
    "@12345", "@54321", "@00000", "@11111", "@78600", "@11223", "@10000", "@20000", "@50000",
    "@01711", "@01911", "@01811", "@01611", "@78612", "@56789", "@98765", "@43210", "@00786",
    "@10101", "1990", "1991", "1992", "1993", "1994", "1995", "1996", "1997", "1998", "1999",
    "2000", "2001", "2002", "2003", "2004", "2005", "2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013", "2014", "2015", "2016", "2017", "2018", "2019", "2020", "2024", "2025", "2026", "@12345",
    "1122", "1212", "123", "1234", "4321", "321", "2233", "4455", "5566", "7788", "8899", "0000", "9999", "@4321", "@321",
    "12345", "54321", "00000", "11111", "78600", "11223", "10000", "20000", "50000", "@999",
    "01711", "01911", "01811", "01611", "78612", "56789", "98765", "43210", "00786", "10101"
]

    try:
        with open(input_file, 'r', encoding='utf-8') as infile, \
             open(output_file, 'w', encoding='utf-8') as outfile:
            
            for line in infile:
                name = line.strip()
                if name:  # খালি লাইন বাদ দেওয়ার জন্য
                    # প্রতিটি নামের জন্য ৬টি ভিন্ন কম্বিনেশন তৈরি
                    for p in patterns:
                        outfile.write(f"{name}{p}\n")
        
        print(f"successful: '{output_file}'file generated")
        print(f"from 'name.txt' file")
        
    except Exception as e:
        print(f"error: {e}")

